---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.MarbleColor1
source: html/2a0c038b-0b82-da88-29c8-da6326ff42ad.htm
---
# Autodesk.Revit.DB.Visual.Marble.MarbleColor1 Property

The property labeled "Stone Color" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string MarbleColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.